{
  "type": "faq",
  "items": [
    {
      "q": "Elevator pitch",
      "a": "I'm Samyam, a Data Analyst and QA Engineer with 4+ years across data validation, BI reporting, test automation, and IT support. I have an M.S. in Information Science and combine a QA mindset with Power BI, SQL, and Python to validate data, build dashboards, and improve reliability. I'm targeting Data Analyst, Business Analyst, QA Engineer, and IT Support roles. No visa sponsorship required."
    },
    {
      "q": "What I'm looking for",
      "a": "I'm targeting Data Analyst, Business Analyst, QA Engineer, and IT Support / Service Desk roles where I can own data pipelines, validate data and features, build dashboards and knowledge bases, and partner with stakeholders to turn requirements into reliable outcomes."
    },
    {
      "q": "Top skills",
      "a": "Data: Power BI, Tableau, Excel, SQL (MySQL, Oracle), Python (Pandas, NumPy), DAX, Qualtrics, Snowflake. QA: Cypress, Selenium, Postman, Swagger, K6, JIRA. IT Support: KACE, DUO, Microsoft Authenticator, AssetTiger, Windows/macOS. Methods: Agile, SDLC, incident management."
    },
    {
      "q": "Recent experience",
      "a": "I'm currently a Technical Support Assistant at the University of New Haven, resolving 600+ incidents, reimaging Windows/macOS systems, maintaining MFA and knowledge base (120+ articles, 25% improvement in self-service resolution), and building Power BI/Excel reports. I was a Python Teaching Assistant (May–Aug 2025) and before that QA Engineer II at Innovate Tech (Cypress, Postman, K6, JIRA) and QA Assistant at SB Solutions."
    },
    {
      "q": "Pronouns",
      "a": "she/her"
    },
    {
      "q": "Interests",
      "a": "Cooking, listening to music, watching movies, and cafe hopping."
    },
    {
      "q": "Work authorization & timeline",
      "a": "No visa sponsorship required. I completed my M.S. in Information Science in Dec 2025. I'm open to full-time roles, internships, and co-ops in Data Analysis, QA, Business Analysis, and IT Support."
    }
  ]
}
